cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
            <register>
                  <name>TAxEX0</name>
                  <displayName>EX0</displayName>
                  <description>TimerAx Expansion 0 Register</description>
                  <addressOffset>0x20</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>TAIDEX</name>
                        <description>Input divider expansion</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>TAIDEX_0</name>
                                <description>Divide by 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIDEX_1</name>
                                <description>Divide by 2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIDEX_2</name>
                                <description>Divide by 3</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIDEX_3</name>
                                <description>Divide by 4</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIDEX_4</name>
                                <description>Divide by 5</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIDEX_5</name>
                                <description>Divide by 6</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIDEX_6</name>
                                <description>Divide by 7</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIDEX_7</name>
                                <description>Divide by 8</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>TAxIV</name>
                  <displayName>IV</displayName>
                  <description>TimerAx Interrupt Vector Register</description>
                  <addressOffset>0x2E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>TAIV</name>
                        <description>TimerA interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>TAIV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>TAIV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIV_2</name>
                                <description>Interrupt Source: Capture/compare 1; Interrupt Flag: TAxCCR1 CCIFG; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIV_4</name>
                                <description>Interrupt Source: Capture/compare 2; Interrupt Flag: TAxCCR2 CCIFG</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIV_6</name>
                                <description>Interrupt Source: Capture/compare 3; Interrupt Flag: TAxCCR3 CCIFG</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIV_8</name>
                                <description>Interrupt Source: Capture/compare 4; Interrupt Flag: TAxCCR4 CCIFG</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIV_10</name>
                                <description>Interrupt Source: Capture/compare 5; Interrupt Flag: TAxCCR5 CCIFG</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIV_12</name>
                                <description>Interrupt Source: Capture/compare 6; Interrupt Flag: TAxCCR6 CCIFG</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIV_14</name>
                                <description>Interrupt Source: Timer overflow; Interrupt Flag: TAxCTL TAIFG; Interrupt Priority: Lowest</description>
                                <value>14</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
