cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>COMP_E0</name>
        <version>356.0</version>
        <description>COMP_E0</description>
        <baseAddress>0x40003400</baseAddress>
        <interrupt>
            <name>COMP_E0_IRQ</name>
            <description>COMP_E0 Interrupt</description>
            <value>6</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>CExCTL0</name>
                  <displayName>CTL0</displayName>
                  <description>Comparator Control Register 0</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CEIPSEL</name>
                        <description>Channel input selected for the V+ terminal</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEIPSEL_0</name>
                                <description>Channel 0 selected</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_1</name>
                                <description>Channel 1 selected</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_2</name>
                                <description>Channel 2 selected</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_3</name>
                                <description>Channel 3 selected</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_4</name>
                                <description>Channel 4 selected</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_5</name>
                                <description>Channel 5 selected</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_6</name>
                                <description>Channel 6 selected</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_7</name>
                                <description>Channel 7 selected</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_8</name>
                                <description>Channel 8 selected</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_9</name>
                                <description>Channel 9 selected</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_10</name>
                                <description>Channel 10 selected</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_11</name>
                                <description>Channel 11 selected</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_12</name>
                                <description>Channel 12 selected</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_13</name>
                                <description>Channel 13 selected</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_14</name>
                                <description>Channel 14 selected</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPSEL_15</name>
                                <description>Channel 15 selected</description>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEIPEN</name>
                        <description>Channel input enable for the V+ terminal</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEIPEN_0</name>
                                <description>Selected analog input channel for V+ terminal is disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIPEN_1</name>
                                <description>Selected analog input channel for V+ terminal is enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEIMSEL</name>
                        <description>Channel input selected for the - terminal</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEIMSEL_0</name>
                                <description>Channel 0 selected</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_1</name>
                                <description>Channel 1 selected</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_2</name>
                                <description>Channel 2 selected</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_3</name>
                                <description>Channel 3 selected</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_4</name>
                                <description>Channel 4 selected</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_5</name>
                                <description>Channel 5 selected</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_6</name>
                                <description>Channel 6 selected</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_7</name>
                                <description>Channel 7 selected</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_8</name>
                                <description>Channel 8 selected</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_9</name>
                                <description>Channel 9 selected</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_10</name>
                                <description>Channel 10 selected</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_11</name>
                                <description>Channel 11 selected</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_12</name>
                                <description>Channel 12 selected</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_13</name>
                                <description>Channel 13 selected</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_14</name>
                                <description>Channel 14 selected</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMSEL_15</name>
                                <description>Channel 15 selected</description>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEIMEN</name>
                        <description>Channel input enable for the - terminal</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEIMEN_0</name>
                                <description>Selected analog input channel for V- terminal is disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIMEN_1</name>
                                <description>Selected analog input channel for V- terminal is enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
