cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
            <register>
                  <name>PCDS</name>
                  <displayName>PCDS</displayName>
                  <description>Port C Drive Strength</description>
                  <addressOffset>0x48</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>P5DS</name>
                        <description>Port 5 Drive Strength</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P6DS</name>
                        <description>Port 6 Drive Strength</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCSEL0</name>
                  <displayName>PCSEL0</displayName>
                  <description>Port C Select 0</description>
                  <addressOffset>0x4A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P5SEL0</name>
                        <description>Port 5 Select 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P6SEL0</name>
                        <description>Port 6 Select 0</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCSEL1</name>
                  <displayName>PCSEL1</displayName>
                  <description>Port C Select 1</description>
                  <addressOffset>0x4C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P5SEL1</name>
                        <description>Port 5 Select 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P6SEL1</name>
                        <description>Port 6 Select 1</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P5IV</name>
                  <displayName>P5IV</displayName>
                  <description>Port 5 Interrupt Vector Register</description>
                  <addressOffset>0x4E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P5IV</name>
                        <description>Port 5 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>P5IV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>P5IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P5IV_2</name>
                                <description>Interrupt Source: Port 5.0 interrupt; Interrupt Flag: P5IFG0; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P5IV_4</name>
                                <description>Interrupt Source: Port 5.1 interrupt; Interrupt Flag: P5IFG1</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P5IV_6</name>
                                <description>Interrupt Source: Port 5.2 interrupt; Interrupt Flag: P5IFG2</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P5IV_8</name>
                                <description>Interrupt Source: Port 5.3 interrupt; Interrupt Flag: P5IFG3</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P5IV_10</name>
                                <description>Interrupt Source: Port 5.4 interrupt; Interrupt Flag: P5IFG4</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P5IV_12</name>
                                <description>Interrupt Source: Port 5.5 interrupt; Interrupt Flag: P5IFG5</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P5IV_14</name>
                                <description>Interrupt Source: Port 5.6 interrupt; Interrupt Flag: P5IFG6</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P5IV_16</name>
                                <description>Interrupt Source: Port 5.7 interrupt; Interrupt Flag: P5IFG7; Interrupt Priority: Lowest</description>
                                <value>16</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCSELC</name>
                  <displayName>PCSELC</displayName>
                  <description>Port C Complement Select</description>
                  <addressOffset>0x56</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P5SELC</name>
                        <description>Port 5 Complement Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P6SELC</name>
                        <description>Port 6 Complement Select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCIES</name>
                  <displayName>PCIES</displayName>
                  <description>Port C Interrupt Edge Select</description>
                  <addressOffset>0x58</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P5IES</name>
                        <description>Port 5 Interrupt Edge Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P6IES</name>
                        <description>Port 6 Interrupt Edge Select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCIE</name>
                  <displayName>PCIE</displayName>
                  <description>Port C Interrupt Enable</description>
                  <addressOffset>0x5A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P5IE</name>
                        <description>Port 5 Interrupt Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P6IE</name>
                        <description>Port 6 Interrupt Enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCIFG</name>
                  <displayName>PCIFG</displayName>
                  <description>Port C Interrupt Flag</description>
                  <addressOffset>0x5C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P5IFG</name>
                        <description>Port 5 Interrupt Flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P6IFG</name>
                        <description>Port 6 Interrupt Flag</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P6IV</name>
                  <displayName>P6IV</displayName>
                  <description>Port 6 Interrupt Vector Register</description>
                  <addressOffset>0x5E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>P6IV</name>
                        <description>Port 6 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>P6IV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>P6IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P6IV_2</name>
                                <description>Interrupt Source: Port 6.0 interrupt; Interrupt Flag: P6IFG0; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P6IV_4</name>
                                <description>Interrupt Source: Port 6.1 interrupt; Interrupt Flag: P6IFG1</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P6IV_6</name>
                                <description>Interrupt Source: Port 6.2 interrupt; Interrupt Flag: P6IFG2</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P6IV_8</name>
                                <description>Interrupt Source: Port 6.3 interrupt; Interrupt Flag: P6IFG3</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P6IV_10</name>
                                <description>Interrupt Source: Port 6.4 interrupt; Interrupt Flag: P6IFG4</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P6IV_12</name>
                                <description>Interrupt Source: Port 6.5 interrupt; Interrupt Flag: P6IFG5</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P6IV_14</name>
                                <description>Interrupt Source: Port 6.6 interrupt; Interrupt Flag: P6IFG6</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P6IV_16</name>
                                <description>Interrupt Source: Port 6.7 interrupt; Interrupt Flag: P6IFG7; Interrupt Priority: Lowest</description>
                                <value>16</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDIN</name>
                  <displayName>PDIN</displayName>
                  <description>Port D Input</description>
                  <addressOffset>0x60</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P7IN</name>
                        <description>Port 7 Input</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>P8IN</name>
                        <description>Port 8 Input</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDOUT</name>
                  <displayName>PDOUT</displayName>
                  <description>Port D Output</description>
                  <addressOffset>0x62</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P7OUT</name>
                        <description>Port 7 Output</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P8OUT</name>
                        <description>Port 8 Output</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDDIR</name>
                  <displayName>PDDIR</displayName>
                  <description>Port D Direction</description>
                  <addressOffset>0x64</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P7DIR</name>
                        <description>Port 7 Direction</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P8DIR</name>
                        <description>Port 8 Direction</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDREN</name>
                  <displayName>PDREN</displayName>
                  <description>Port D Resistor Enable</description>
                  <addressOffset>0x66</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P7REN</name>
                        <description>Port 7 Resistor Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P8REN</name>
                        <description>Port 8 Resistor Enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDDS</name>
                  <displayName>PDDS</displayName>
                  <description>Port D Drive Strength</description>
                  <addressOffset>0x68</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>P7DS</name>
                        <description>Port 7 Drive Strength</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P8DS</name>
                        <description>Port 8 Drive Strength</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDSEL0</name>
                  <displayName>PDSEL0</displayName>
                  <description>Port D Select 0</description>
                  <addressOffset>0x6A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P7SEL0</name>
                        <description>Port 7 Select 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P8SEL0</name>
                        <description>Port 8 Select 0</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDSEL1</name>
                  <displayName>PDSEL1</displayName>
                  <description>Port D Select 1</description>
                  <addressOffset>0x6C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P7SEL1</name>
                        <description>Port 7 Select 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P8SEL1</name>
                        <description>Port 8 Select 1</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
