cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
            <register>
                  <name>P9IV</name>
                  <displayName>P9IV</displayName>
                  <description>Port 9 Interrupt Vector Register</description>
                  <addressOffset>0x8E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P9IV</name>
                        <description>Port 9 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>P9IV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>P9IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P9IV_2</name>
                                <description>Interrupt Source: Port 9.0 interrupt; Interrupt Flag: P9IFG0; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P9IV_4</name>
                                <description>Interrupt Source: Port 9.1 interrupt; Interrupt Flag: P9IFG1</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P9IV_6</name>
                                <description>Interrupt Source: Port 9.2 interrupt; Interrupt Flag: P9IFG2</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P9IV_8</name>
                                <description>Interrupt Source: Port 9.3 interrupt; Interrupt Flag: P9IFG3</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P9IV_10</name>
                                <description>Interrupt Source: Port 9.4 interrupt; Interrupt Flag: P9IFG4</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P9IV_12</name>
                                <description>Interrupt Source: Port 9.5 interrupt; Interrupt Flag: P9IFG5</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P9IV_14</name>
                                <description>Interrupt Source: Port 9.6 interrupt; Interrupt Flag: P9IFG6</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P9IV_16</name>
                                <description>Interrupt Source: Port 9.7 interrupt; Interrupt Flag: P9IFG7; Interrupt Priority: Lowest</description>
                                <value>16</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PESELC</name>
                  <displayName>PESELC</displayName>
                  <description>Port E Complement Select</description>
                  <addressOffset>0x96</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P9SELC</name>
                        <description>Port 9 Complement Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P10SELC</name>
                        <description>Port 10 Complement Select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PEIES</name>
                  <displayName>PEIES</displayName>
                  <description>Port E Interrupt Edge Select</description>
                  <addressOffset>0x98</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P9IES</name>
                        <description>Port 9 Interrupt Edge Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P10IES</name>
                        <description>Port 10 Interrupt Edge Select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PEIE</name>
                  <displayName>PEIE</displayName>
                  <description>Port E Interrupt Enable</description>
                  <addressOffset>0x9A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P9IE</name>
                        <description>Port 9 Interrupt Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P10IE</name>
                        <description>Port 10 Interrupt Enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PEIFG</name>
                  <displayName>PEIFG</displayName>
                  <description>Port E Interrupt Flag</description>
                  <addressOffset>0x9C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P9IFG</name>
                        <description>Port 9 Interrupt Flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P10IFG</name>
                        <description>Port 10 Interrupt Flag</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P10IV</name>
                  <displayName>P10IV</displayName>
                  <description>Port 10 Interrupt Vector Register</description>
                  <addressOffset>0x9E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>P10IV</name>
                        <description>Port 10 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>P10IV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>P10IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P10IV_2</name>
                                <description>Interrupt Source: Port 10.0 interrupt; Interrupt Flag: P10IFG0; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P10IV_4</name>
                                <description>Interrupt Source: Port 10.1 interrupt; Interrupt Flag: P10IFG1</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P10IV_6</name>
                                <description>Interrupt Source: Port 10.2 interrupt; Interrupt Flag: P10IFG2</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P10IV_8</name>
                                <description>Interrupt Source: Port 10.3 interrupt; Interrupt Flag: P10IFG3</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P10IV_10</name>
                                <description>Interrupt Source: Port 10.4 interrupt; Interrupt Flag: P10IFG4</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P10IV_12</name>
                                <description>Interrupt Source: Port 10.5 interrupt; Interrupt Flag: P10IFG5</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P10IV_14</name>
                                <description>Interrupt Source: Port 10.6 interrupt; Interrupt Flag: P10IFG6</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P10IV_16</name>
                                <description>Interrupt Source: Port 10.7 interrupt; Interrupt Flag: P10IFG7; Interrupt Priority: Lowest</description>
                                <value>16</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PJIN</name>
                  <displayName>PJIN</displayName>
                  <description>Port J Input</description>
                  <addressOffset>0x120</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>PJIN</name>
                        <description>Port J Input</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PJOUT</name>
                  <displayName>PJOUT</displayName>
                  <description>Port J Output</description>
                  <addressOffset>0x122</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>PJOUT</name>
                        <description>Port J Output</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PJDIR</name>
                  <displayName>PJDIR</displayName>
                  <description>Port J Direction</description>
                  <addressOffset>0x124</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>PJDIR</name>
                        <description>Port J Direction</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PJREN</name>
                  <displayName>PJREN</displayName>
                  <description>Port J Resistor Enable</description>
                  <addressOffset>0x126</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>PJREN</name>
                        <description>Port J Resistor Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PJDS</name>
                  <displayName>PJDS</displayName>
                  <description>Port J Drive Strength</description>
                  <addressOffset>0x128</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PJDS</name>
                        <description>Port J Drive Strength</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PJSEL0</name>
                  <displayName>PJSEL0</displayName>
                  <description>Port J Select 0</description>
                  <addressOffset>0x12A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>PJSEL0</name>
                        <description>Port J Select 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PJSEL1</name>
                  <displayName>PJSEL1</displayName>
                  <description>Port J Select 1</description>
                  <addressOffset>0x12C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>PJSEL1</name>
                        <description>Port J Select 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PJSELC</name>
                  <displayName>PJSELC</displayName>
                  <description>Port J Complement Select</description>
                  <addressOffset>0x136</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>PJSELC</name>
                        <description>Port J Complement Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
