cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>PMAP</name>
        <version>356.0</version>
        <description>PMAP</description>
        <baseAddress>0x40005000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x40</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>PMAPKEYID</name>
                  <displayName>KEYID</displayName>
                  <description>Port Mapping Key Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x000096a5</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>PMAPKEY</name>
                        <description>Port mapping controller write access key</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PMAPCTL</name>
                  <displayName>CTL</displayName>
                  <description>Port Mapping Control Register</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000001</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>PMAPLOCKED</name>
                        <description>Port mapping lock bit</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>PMAPLOCKED_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>PMAPLOCKED_0</name>
                                <description>Access to mapping registers is granted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PMAPLOCKED_1</name>
                                <description>Access to mapping registers is locked</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PMAPRECFG</name>
                        <description>Port mapping reconfiguration control bit</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PMAPRECFG_0</name>
                                <description>Configuration allowed only once</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PMAPRECFG_1</name>
                                <description>Allow reconfiguration of port mapping</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P1MAP01</name>
                  <displayName>P1MAP01</displayName>
                  <description>Port mapping register, P1.0 and P1.1</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P1MAP23</name>
                  <displayName>P1MAP23</displayName>
                  <description>Port mapping register, P1.2 and P1.3</description>
                  <addressOffset>0xA</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P1MAP45</name>
                  <displayName>P1MAP45</displayName>
                  <description>Port mapping register, P1.4 and P1.5</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P1MAP67</name>
                  <displayName>P1MAP67</displayName>
                  <description>Port mapping register, P1.6 and P1.7</description>
                  <addressOffset>0xE</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P2MAP01</name>
                  <displayName>P2MAP01</displayName>
                  <description>Port mapping register, P2.0 and P2.1</description>
                  <addressOffset>0x10</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P2MAP23</name>
                  <displayName>P2MAP23</displayName>
                  <description>Port mapping register, P2.2 and P2.3</description>
                  <addressOffset>0x12</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P2MAP45</name>
                  <displayName>P2MAP45</displayName>
                  <description>Port mapping register, P2.4 and P2.5</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P2MAP67</name>
                  <displayName>P2MAP67</displayName>
                  <description>Port mapping register, P2.6 and P2.7</description>
                  <addressOffset>0x16</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P3MAP01</name>
                  <displayName>P3MAP01</displayName>
                  <description>Port mapping register, P3.0 and P3.1</description>
                  <addressOffset>0x18</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P3MAP23</name>
                  <displayName>P3MAP23</displayName>
                  <description>Port mapping register, P3.2 and P3.3</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P3MAP45</name>
                  <displayName>P3MAP45</displayName>
                  <description>Port mapping register, P3.4 and P3.5</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P3MAP67</name>
                  <displayName>P3MAP67</displayName>
                  <description>Port mapping register, P3.6 and P3.7</description>
                  <addressOffset>0x1E</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P4MAP01</name>
                  <displayName>P4MAP01</displayName>
                  <description>Port mapping register, P4.0 and P4.1</description>
                  <addressOffset>0x20</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P4MAP23</name>
                  <displayName>P4MAP23</displayName>
                  <description>Port mapping register, P4.2 and P4.3</description>
                  <addressOffset>0x22</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P4MAP45</name>
                  <displayName>P4MAP45</displayName>
                  <description>Port mapping register, P4.4 and P4.5</description>
                  <addressOffset>0x24</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P4MAP67</name>
                  <displayName>P4MAP67</displayName>
                  <description>Port mapping register, P4.6 and P4.7</description>
                  <addressOffset>0x26</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P5MAP01</name>
                  <displayName>P5MAP01</displayName>
                  <description>Port mapping register, P5.0 and P5.1</description>
                  <addressOffset>0x28</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P5MAP23</name>
                  <displayName>P5MAP23</displayName>
                  <description>Port mapping register, P5.2 and P5.3</description>
                  <addressOffset>0x2A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P5MAP45</name>
                  <displayName>P5MAP45</displayName>
                  <description>Port mapping register, P5.4 and P5.5</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P5MAP67</name>
                  <displayName>P5MAP67</displayName>
                  <description>Port mapping register, P5.6 and P5.7</description>
                  <addressOffset>0x2E</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P6MAP01</name>
                  <displayName>P6MAP01</displayName>
                  <description>Port mapping register, P6.0 and P6.1</description>
                  <addressOffset>0x30</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P6MAP23</name>
                  <displayName>P6MAP23</displayName>
                  <description>Port mapping register, P6.2 and P6.3</description>
                  <addressOffset>0x32</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P6MAP45</name>
                  <displayName>P6MAP45</displayName>
                  <description>Port mapping register, P6.4 and P6.5</description>
                  <addressOffset>0x34</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P6MAP67</name>
                  <displayName>P6MAP67</displayName>
                  <description>Port mapping register, P6.6 and P6.7</description>
                  <addressOffset>0x36</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P7MAP01</name>
                  <displayName>P7MAP01</displayName>
                  <description>Port mapping register, P7.0 and P7.1</description>
                  <addressOffset>0x38</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P7MAP23</name>
                  <displayName>P7MAP23</displayName>
                  <description>Port mapping register, P7.2 and P7.3</description>
                  <addressOffset>0x3A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
