cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
            <register>
                  <name>CSCLRIFG</name>
                  <displayName>CLRIFG</displayName>
                  <description>Clear Interrupt Flag Register</description>
                  <addressOffset>0x50</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLR_LFXTIFG</name>
                        <description>Clear LFXT oscillator fault interrupt flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_LFXTIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_LFXTIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_LFXTIFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLR_HFXTIFG</name>
                        <description>Clear HFXT oscillator fault interrupt flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_HFXTIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_HFXTIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_HFXTIFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLR_HFXT2IFG</name>
                        <description>Clear HFXT2 oscillator fault interrupt flag</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_HFXT2IFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_HFXT2IFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_HFXT2IFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLR_DCOR_OPNIFG</name>
                        <description>Clear DCO external resistor open circuit fault interrupt flag.</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_DCOR_OPNIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_DCOR_OPNIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_DCOR_OPNIFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLR_CALIFG</name>
                        <description>REFCNT period counter clear interrupt flag</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_CALIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_CALIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_CALIFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLR_FCNTLFIFG</name>
                        <description>Start fault counter clear interrupt flag LFXT</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_FCNTLFIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_FCNTLFIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_FCNTLFIFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLR_FCNTHFIFG</name>
                        <description>Start fault counter clear interrupt flag HFXT</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_FCNTHFIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_FCNTHFIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_FCNTHFIFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLR_FCNTHF2IFG</name>
                        <description>Start fault counter clear interrupt flag HFXT2</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_FCNTHF2IFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_FCNTHF2IFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_FCNTHF2IFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLR_PLLOOLIFG</name>
                        <description>PLL out-of-lock clear interrupt flag</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_PLLOOLIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_PLLOOLIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_PLLOOLIFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLR_PLLLOSIFG</name>
                        <description>PLL loss-of-signal clear interrupt flag</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_PLLLOSIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_PLLLOSIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_PLLLOSIFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLR_PLLOORIFG</name>
                        <description>PLL out-of-range clear interrupt flag</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_PLLOORIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_PLLOORIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_PLLOORIFG_1</name>
                                <description>Clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
