cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS55_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS56</name>
                        <description>LCD pin 56 enable</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS56_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS56_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS57</name>
                        <description>LCD pin 57 enable</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS57_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS57_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS58</name>
                        <description>LCD pin 58 enable</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS58_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS58_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS59</name>
                        <description>LCD pin 59 enable</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS59_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS59_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS60</name>
                        <description>LCD pin 60 enable</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS60_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS60_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS61</name>
                        <description>LCD pin 61 enable</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS61_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS61_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS62</name>
                        <description>LCD pin 62 enable</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS62_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS62_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS63</name>
                        <description>LCD pin 63 enable</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS63_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS63_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
