cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
            <register>
                  <name>LCDCSSEL1</name>
                  <displayName>CSSEL1</displayName>
                  <description>LCD_F COM/SEG select register 1</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LCDCSS32</name>
                        <description>L32 Com Seg select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS32_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS32_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS33</name>
                        <description>L33 Com Seg select</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS33_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS33_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS34</name>
                        <description>L34 Com Seg select</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS34_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS34_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS35</name>
                        <description>L35 Com Seg select</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS35_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS35_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS36</name>
                        <description>L36 Com Seg select</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS36_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS36_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS37</name>
                        <description>L37 Com Seg select</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS37_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS37_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS38</name>
                        <description>L38 Com Seg select</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS38_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS38_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS39</name>
                        <description>L39 Com Seg select</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS39_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS39_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS40</name>
                        <description>L40 Com Seg select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS40_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS40_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS41</name>
                        <description>L41 Com Seg select</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS41_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS41_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS42</name>
                        <description>L42 Com Seg select</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS42_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS42_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS43</name>
                        <description>L43 Com Seg select</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS43_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS43_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS44</name>
                        <description>L44 Com Seg select</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS44_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS44_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS45</name>
                        <description>L45 Com Seg select</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS45_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS45_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS46</name>
                        <description>L46 Com Seg select</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS46_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS46_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS47</name>
                        <description>L47 Com Seg select</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS47_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS47_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS48</name>
                        <description>L48 Com Seg select</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS48_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS48_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS49</name>
                        <description>L49 Com Seg select</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS49_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS49_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS50</name>
                        <description>L50 Com Seg select</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS50_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS50_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS51</name>
                        <description>L51 Com Seg select</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS51_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS51_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS52</name>
                        <description>L52 Com Seg select</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS52_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS52_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS53</name>
                        <description>L53 Com Seg select</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS53_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS53_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS54</name>
                        <description>L54 Com Seg select</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS54_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS54_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS55</name>
                        <description>L55 Com Seg select</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS55_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS55_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS56</name>
                        <description>L56 Com Seg select</description>
                        <bitOffset>0x18</bitOffset>
