cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS56_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS56_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS57</name>
                        <description>L57 Com Seg select</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS57_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS57_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS58</name>
                        <description>L58 Com Seg select</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS58_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS58_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS59</name>
                        <description>L59 Com Seg select</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS59_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS59_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS60</name>
                        <description>L60 Com Seg select</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS60_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS60_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS61</name>
                        <description>L61 Com Seg select</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS61_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS61_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS62</name>
                        <description>L62 Com Seg select</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS62_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS62_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCSS63</name>
                        <description>L63 Com Seg select</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCSS63_0</name>
                                <description>Segment line</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCSS63_1</name>
                                <description>Common line</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>LCDANMCTL</name>
                  <displayName>ANMCTL</displayName>
                  <description>LCD_F Animation Control Register</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LCDANMEN</name>
                        <description>Enable Animation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDANMEN_0</name>
                                <description>Animation disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMEN_1</name>
                                <description>Animation enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDANMSTP</name>
                        <description>Number of Amimation frames</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDANMSTP_0</name>
                                <description>T0</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMSTP_1</name>
                                <description>T0 to T1</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMSTP_2</name>
                                <description>T0 to T2</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMSTP_3</name>
                                <description>T0 to T3</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMSTP_4</name>
                                <description>T0 to T4</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMSTP_5</name>
                                <description>T0 to T5</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMSTP_6</name>
                                <description>T0 to T6</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMSTP_7</name>
                                <description>T0 to T7</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDANMCLR</name>
                        <description>Clear Animation Memory</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDANMCLR_0</name>
                                <description>Contents of animation memory registers LCDANMx remain unchanged</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMCLR_1</name>
                                <description>Clear content of all animation memory registers LCDANMx</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDANMPREx</name>
                        <description>Clock pre-scaler for animation frequency</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDANMPREx_0</name>
                                <description>Divide by 512</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMPREx_1</name>
                                <description>Divide by 1024</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMPREx_2</name>
                                <description>Divide by 2048</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMPREx_3</name>
                                <description>Divide by 4096</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMPREx_4</name>
                                <description>Divide by 8162</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMPREx_5</name>
                                <description>Divide by 16384</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMPREx_6</name>
                                <description>Divide by 32768</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMPREx_7</name>
                                <description>Divide by 65536</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDANMDIVx</name>
                        <description>Clock divider for animation frequency</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDANMDIVx_0</name>
                                <description>Divide by 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMDIVx_1</name>
                                <description>Divide by 2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMDIVx_2</name>
                                <description>Divide by 3</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMDIVx_3</name>
                                <description>Divide by 4</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMDIVx_4</name>
                                <description>Divide by 5</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMDIVx_5</name>
                                <description>Divide by 6</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMDIVx_6</name>
                                <description>Divide by 7</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMDIVx_7</name>
                                <description>Divide by 8</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>LCDIE</name>
                  <displayName>IE</displayName>
                  <description>LCD_F interrupt enable register</description>
                  <addressOffset>0x110</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LCDBLKOFFIE</name>
                        <description>LCD Blink, segments off interrupt enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDBLKOFFIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKOFFIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDBLKONIE</name>
                        <description>LCD Blink, segments on interrupt enable</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDBLKONIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKONIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDFRMIE</name>
                        <description>LCD Frame interrupt enable</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDFRMIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDFRMIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDANMSTPIE</name>
                        <description>LCD Animation step interrupt enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDANMSTPIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMSTPIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDANMLOOPIE</name>
                        <description>LCD Animation loop interrupt enable</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDANMLOOPIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMLOOPIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
