cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
            <register>
                  <name>MPU_RASR</name>
                  <displayName>RASR</displayName>
                  <description>MPU Region Attribute and Size Register</description>
                  <addressOffset>0xDA0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Region enable bit.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SIZE</name>
                        <description>MPU Protection Region Size Field.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00100</name>
                                <description>32B</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b00101</name>
                                <description>64B</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b00110</name>
                                <description>128B</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b00111</name>
                                <description>256B</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01000</name>
                                <description>512B</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01001</name>
                                <description>1KB</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01010</name>
                                <description>2KB</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01011</name>
                                <description>4KB</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01100</name>
                                <description>8KB</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01101</name>
                                <description>16KB</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01110</name>
                                <description>32KB</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01111</name>
                                <description>64KB</description>
                                <value>15</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10000</name>
                                <description>128KB</description>
                                <value>16</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10001</name>
                                <description>256KB</description>
                                <value>17</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10010</name>
                                <description>512KB</description>
                                <value>18</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10011</name>
                                <description>1MB</description>
                                <value>19</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10100</name>
                                <description>2MB</description>
                                <value>20</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10101</name>
                                <description>4MB</description>
                                <value>21</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10110</name>
                                <description>8MB</description>
                                <value>22</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10111</name>
                                <description>16MB</description>
                                <value>23</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11000</name>
                                <description>32MB</description>
                                <value>24</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11001</name>
                                <description>64MB</description>
                                <value>25</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11010</name>
                                <description>128MB</description>
                                <value>26</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11011</name>
                                <description>256MB</description>
                                <value>27</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11100</name>
                                <description>512MB</description>
                                <value>28</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11101</name>
                                <description>1GB</description>
                                <value>29</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11110</name>
                                <description>2GB</description>
                                <value>30</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11111</name>
                                <description>4GB</description>
                                <value>31</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SRD</name>
                        <description>Sub-Region Disable (SRD) field. Setting an SRD bit disables the corresponding sub-region. Regions are split into eight equal-sized sub-regions. Sub-regions are not supported for region sizes of 128 bytes and less.</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>B</name>
                        <description>Bufferable bit</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>not bufferable</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>bufferable</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>C</name>
                        <description>Cacheable bit</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>not cacheable</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>cacheable</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>S</name>
                        <description>Shareable bit</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>not shareable</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>shareable</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TEX</name>
                        <description>Type extension field</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AP</name>
                        <description>Data access permission field</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b000</name>
                                <description>Priviliged permissions: No access. User permissions: No access.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b001</name>
                                <description>Priviliged permissions: Read-write. User permissions: No access.</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b010</name>
                                <description>Priviliged permissions: Read-write. User permissions: Read-only.</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b011</name>
                                <description>Priviliged permissions: Read-write. User permissions: Read-write.</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b101</name>
                                <description>Priviliged permissions: Read-only. User permissions: No access.</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b110</name>
                                <description>Priviliged permissions: Read-only. User permissions: Read-only.</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b111</name>
                                <description>Priviliged permissions: Read-only. User permissions: Read-only.</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>XN</name>
                        <description>Instruction access disable bit</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>enable instruction fetches</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>disable instruction fetches</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>MPU_RBAR_A1</name>
                  <displayName>RBAR_A1</displayName>
                  <description>MPU Alias 1 Region Base Address register</description>
                  <addressOffset>0xDA4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
            </register>
            <register>
                  <name>MPU_RASR_A1</name>
                  <displayName>RASR_A1</displayName>
                  <description>MPU Alias 1 Region Attribute and Size register</description>
                  <addressOffset>0xDA8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
            </register>
            <register>
                  <name>MPU_RBAR_A2</name>
                  <displayName>RBAR_A2</displayName>
                  <description>MPU Alias 2 Region Base Address register</description>
                  <addressOffset>0xDAC</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
            </register>
            <register>
                  <name>MPU_RASR_A2</name>
                  <displayName>RASR_A2</displayName>
                  <description>MPU Alias 2 Region Attribute and Size register</description>
                  <addressOffset>0xDB0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
            </register>
            <register>
                  <name>MPU_RBAR_A3</name>
                  <displayName>RBAR_A3</displayName>
                  <description>MPU Alias 3 Region Base Address register</description>
                  <addressOffset>0xDB4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>MPU_RASR_A3</name>
                  <displayName>RASR_A3</displayName>
                  <description>MPU Alias 3 Region Attribute and Size register</description>
                  <addressOffset>0xDB8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
            </register>
