cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
            <register>
                  <name>IPR5</name>
                  <displayName>IPR5</displayName>
                  <description>Irq 20 to 23 Priority Register</description>
                  <addressOffset>0x414</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_20</name>
                        <description>Priority of interrupt 20</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_21</name>
                        <description>Priority of interrupt 21</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_22</name>
                        <description>Priority of interrupt 22</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_23</name>
                        <description>Priority of interrupt 23</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR6</name>
                  <displayName>IPR6</displayName>
                  <description>Irq 24 to 27 Priority Register</description>
                  <addressOffset>0x418</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_24</name>
                        <description>Priority of interrupt 24</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_25</name>
                        <description>Priority of interrupt 25</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_26</name>
                        <description>Priority of interrupt 26</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_27</name>
                        <description>Priority of interrupt 27</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR7</name>
                  <displayName>IPR7</displayName>
                  <description>Irq 28 to 31 Priority Register</description>
                  <addressOffset>0x41C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_28</name>
                        <description>Priority of interrupt 28</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_29</name>
                        <description>Priority of interrupt 29</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_30</name>
                        <description>Priority of interrupt 30</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_31</name>
                        <description>Priority of interrupt 31</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR8</name>
                  <displayName>IPR8</displayName>
                  <description>Irq 32 to 35 Priority Register</description>
                  <addressOffset>0x420</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_32</name>
                        <description>Priority of interrupt 32</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_33</name>
                        <description>Priority of interrupt 33</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_34</name>
                        <description>Priority of interrupt 34</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_35</name>
                        <description>Priority of interrupt 35</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR9</name>
                  <displayName>IPR9</displayName>
                  <description>Irq 36 to 39 Priority Register</description>
                  <addressOffset>0x424</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_36</name>
                        <description>Priority of interrupt 36</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_37</name>
                        <description>Priority of interrupt 37</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_38</name>
                        <description>Priority of interrupt 38</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_39</name>
                        <description>Priority of interrupt 39</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR10</name>
                  <displayName>IPR10</displayName>
                  <description>Irq 40 to 43 Priority Register</description>
                  <addressOffset>0x428</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_40</name>
                        <description>Priority of interrupt 40</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_41</name>
                        <description>Priority of interrupt 41</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_42</name>
                        <description>Priority of interrupt 42</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_43</name>
                        <description>Priority of interrupt 43</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR11</name>
                  <displayName>IPR11</displayName>
                  <description>Irq 44 to 47 Priority Register</description>
                  <addressOffset>0x42C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_44</name>
                        <description>Priority of interrupt 44</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_45</name>
                        <description>Priority of interrupt 45</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_46</name>
                        <description>Priority of interrupt 46</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_47</name>
                        <description>Priority of interrupt 47</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR12</name>
                  <displayName>IPR12</displayName>
                  <description>Irq 48 to 51 Priority Register</description>
                  <addressOffset>0x430</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_48</name>
                        <description>Priority of interrupt 48</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_49</name>
                        <description>Priority of interrupt 49</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_50</name>
                        <description>Priority of interrupt 50</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_51</name>
                        <description>Priority of interrupt 51</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR13</name>
                  <displayName>IPR13</displayName>
                  <description>Irq 52 to 55 Priority Register</description>
                  <addressOffset>0x434</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_52</name>
                        <description>Priority of interrupt 52</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_53</name>
                        <description>Priority of interrupt 53</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_54</name>
                        <description>Priority of interrupt 54</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_55</name>
                        <description>Priority of interrupt 55</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR14</name>
                  <displayName>IPR14</displayName>
                  <description>Irq 56 to 59 Priority Register</description>
                  <addressOffset>0x438</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_56</name>
                        <description>Priority of interrupt 56</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_57</name>
                        <description>Priority of interrupt 57</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_58</name>
                        <description>Priority of interrupt 58</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_59</name>
                        <description>Priority of interrupt 59</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR15</name>
                  <displayName>IPR15</displayName>
                  <description>Irq 60 to 63 Priority Register</description>
                  <addressOffset>0x43C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_60</name>
                        <description>Priority of interrupt 60</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_61</name>
                        <description>Priority of interrupt 61</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_62</name>
                        <description>Priority of interrupt 62</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_63</name>
                        <description>Priority of interrupt 63</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>STIR</name>
                  <displayName>STIR</displayName>
                  <description>Software Trigger Interrupt Register</description>
                  <addressOffset>0xF00</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>INTID</name>
                        <description>Interrupt ID field. Writing a value to the INTID field is the same as manually pending an interrupt by setting the corresponding interrupt bit in an Interrupt Set Pending Register.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x9</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
