cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
        </registers>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>STCSR</name>
                  <displayName>STCSR</displayName>
                  <description>SysTick Control and Status Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000004</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable SysTick counter</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>First</name>
                                <description>Counter disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TICKINT</name>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>VAL_0</name>
                                <description>Counting down to zero does not pend the SysTick handler. Software can use COUNTFLAG to determine if the SysTick handler has ever counted to zero.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VAL_1</name>
                                <description>Counting down to zero pends the SysTick handler.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLKSOURCE</name>
                        <description>Clock source.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>CLKSOURCE_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>VAL_0</name>
                                <description>Not applicable</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VAL_1</name>
                                <description>Core clock</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COUNTFLAG</name>
                        <description>Returns 1 if timer counted to 0 since last time this was read. Clears on read by application of any part of the SysTick Control and Status Register. If read by the debugger using the DAP, this bit is cleared on read-only if the MasterType bit in the AHB-AP Control Register is set to 0. Otherwise, the COUNTFLAG bit is not changed by the debugger read.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>STRVR</name>
                  <displayName>STRVR</displayName>
                  <description>SysTick Reload Value Register</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>RELOAD</name>
                        <description>Value to load into the SysTick Current Value Register when the counter reaches 0.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x18</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>STCVR</name>
                  <displayName>STCVR</displayName>
                  <description>SysTick Current Value Register</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>CURRENT</name>
                        <description>Current value at the time the register is accessed. No read-modify-write protection is provided, so change with care. Writing to it with any value clears the register to 0. Clearing this register also clears the COUNTFLAG bit of the SysTick Control and Status Register.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x18</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>STCR</name>
                  <displayName>STCR</displayName>
                  <description>SysTick Calibration Value Register</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>TENMS</name>
                        <description>Reads as zero. Indicates calibration value is not known.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x18</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SKEW</name>
                        <description>Reads as one. The calibration value is not exactly 10ms because of clock frequency. This could affect its suitability as a software real time clock.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NOREF</name>
                        <description>Reads as one. Indicates that no separate reference clock is provided.</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
