cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
            <register>
                  <name>SYS_SRAM_BANKEN_CTL1</name>
                  <displayName>SRAM_BANKEN_CTL1</displayName>
                  <description>SRAM Bank Enable Control Register 1</description>
                  <addressOffset>0x54</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BNK32_EN</name>
                        <description>When 1, enables Bank32 of the SRAM</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK32_EN_0</name>
                                <description>Disables Bank32 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK32_EN_1</name>
                                <description>Enables Bank32 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK33_EN</name>
                        <description>When 1, enables Bank33 of the SRAM</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK33_EN_0</name>
                                <description>Disables Bank33 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK33_EN_1</name>
                                <description>Enables Bank33 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK34_EN</name>
                        <description>When 1, enables Bank34 of the SRAM</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK34_EN_0</name>
                                <description>Disables Bank34 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK34_EN_1</name>
                                <description>Enables Bank34 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK35_EN</name>
                        <description>When 1, enables Bank35 of the SRAM</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK35_EN_0</name>
                                <description>Disables Bank35 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK35_EN_1</name>
                                <description>Enables Bank35 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK36_EN</name>
                        <description>When 1, enables Bank36 of the SRAM</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK36_EN_0</name>
                                <description>Disables Bank36 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK36_EN_1</name>
                                <description>Enables Bank36 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK37_EN</name>
                        <description>When 1, enables Bank37 of the SRAM</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK37_EN_0</name>
                                <description>Disables Bank37 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK37_EN_1</name>
                                <description>Enables Bank37 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK38_EN</name>
                        <description>When 1, enables Bank38 of the SRAM</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK38_EN_0</name>
                                <description>Disables Bank38 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK38_EN_1</name>
                                <description>Enables Bank38 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK39_EN</name>
                        <description>When 1, enables Bank39 of the SRAM</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK39_EN_0</name>
                                <description>Disables Bank39 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK39_EN_1</name>
                                <description>Enables Bank39 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK40_EN</name>
                        <description>When 1, enables Bank40 of the SRAM</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK40_EN_0</name>
                                <description>Disables Bank40 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK40_EN_1</name>
                                <description>Enables Bank40 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK41_EN</name>
                        <description>When 1, enables Bank41 of the SRAM</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK41_EN_0</name>
                                <description>Disables Bank41 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK41_EN_1</name>
                                <description>Enables Bank41 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK42_EN</name>
                        <description>When 1, enables Bank42 of the SRAM</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK42_EN_0</name>
                                <description>Disables Bank42 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK42_EN_1</name>
                                <description>Enables Bank42 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK43_EN</name>
                        <description>When 1, enables Bank43 of the SRAM</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK43_EN_0</name>
                                <description>Disables Bank43 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK43_EN_1</name>
                                <description>Enables Bank43 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK44_EN</name>
                        <description>When 1, enables Bank44 of the SRAM</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK44_EN_0</name>
                                <description>Disables Bank44 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK44_EN_1</name>
                                <description>Enables Bank44 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK45_EN</name>
                        <description>When 1, enables Bank45 of the SRAM</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK45_EN_0</name>
                                <description>Disables Bank45 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK45_EN_1</name>
                                <description>Enables Bank45 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK46_EN</name>
                        <description>When 1, enables Bank46 of the SRAM</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK46_EN_0</name>
                                <description>Disables Bank46 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK46_EN_1</name>
                                <description>Enables Bank46 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK47_EN</name>
                        <description>When 1, enables Bank47 of the SRAM</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK47_EN_0</name>
                                <description>Disables Bank47 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK47_EN_1</name>
                                <description>Enables Bank47 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK48_EN</name>
                        <description>When 1, enables Bank48 of the SRAM</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK48_EN_0</name>
                                <description>Disables Bank48 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK48_EN_1</name>
                                <description>Enables Bank48 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK49_EN</name>
                        <description>When 1, enables Bank49 of the SRAM</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK49_EN_0</name>
                                <description>Disables Bank49 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK49_EN_1</name>
                                <description>Enables Bank49 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK50_EN</name>
                        <description>When 1, enables Bank50 of the SRAM</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK50_EN_0</name>
                                <description>Disables Bank50 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK50_EN_1</name>
                                <description>Enables Bank50 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK51_EN</name>
                        <description>When 1, enables Bank51 of the SRAM</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK51_EN_0</name>
                                <description>Disables Bank51 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK51_EN_1</name>
                                <description>Enables Bank51 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK52_EN</name>
                        <description>When 1, enables Bank52 of the SRAM</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK52_EN_0</name>
                                <description>Disables Bank52 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK52_EN_1</name>
                                <description>Enables Bank52 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK53_EN</name>
                        <description>When 1, enables Bank53 of the SRAM</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK53_EN_0</name>
                                <description>Disables Bank53 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK53_EN_1</name>
                                <description>Enables Bank53 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK54_EN</name>
                        <description>When 1, enables Bank54 of the SRAM</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK54_EN_0</name>
                                <description>Disables Bank54 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK54_EN_1</name>
                                <description>Enables Bank54 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK55_EN</name>
