cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
                            <enumeratedValue>
                                <name>BLK53_EN_1</name>
                                <description>Block53 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK54_EN</name>
                        <description>When 1, Block54 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK54_EN_0</name>
                                <description>Block54 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK54_EN_1</name>
                                <description>Block54 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK55_EN</name>
                        <description>When 1, Block55 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK55_EN_0</name>
                                <description>Block55 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK55_EN_1</name>
                                <description>Block55 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK56_EN</name>
                        <description>When 1, Block56 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK56_EN_0</name>
                                <description>Block56 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK56_EN_1</name>
                                <description>Block56 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK57_EN</name>
                        <description>When 1, Block57 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK57_EN_0</name>
                                <description>Block57 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK57_EN_1</name>
                                <description>Block57 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK58_EN</name>
                        <description>When 1, Block58 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK58_EN_0</name>
                                <description>Block58 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK58_EN_1</name>
                                <description>Block58 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK59_EN</name>
                        <description>When 1, Block59 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK59_EN_0</name>
                                <description>Block59 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK59_EN_1</name>
                                <description>Block59 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK60_EN</name>
                        <description>When 1, Block60 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK60_EN_0</name>
                                <description>Block60 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK60_EN_1</name>
                                <description>Block60 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK61_EN</name>
                        <description>When 1, Block61 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK61_EN_0</name>
                                <description>Block61 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK61_EN_1</name>
                                <description>Block61 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK62_EN</name>
                        <description>When 1, Block62 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK62_EN_0</name>
                                <description>Block62 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK62_EN_1</name>
                                <description>Block62 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK63_EN</name>
                        <description>When 1, Block63 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK63_EN_0</name>
                                <description>Block63 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK63_EN_1</name>
                                <description>Block63 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
