cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4111.svd
            <register>
                  <name>SYS_SRAM_BLKRET_CTL2</name>
                  <displayName>SRAM_BLKRET_CTL2</displayName>
                  <description>SRAM Block Retention Control Register 2</description>
                  <addressOffset>0x78</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BLK64_EN</name>
                        <description>When 1, Block64 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK64_EN_0</name>
                                <description>Block64 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK64_EN_1</name>
                                <description>Block64 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK65_EN</name>
                        <description>When 1, Block65 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK65_EN_0</name>
                                <description>Block65 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK65_EN_1</name>
                                <description>Block65 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK66_EN</name>
                        <description>When 1, Block66 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK66_EN_0</name>
                                <description>Block66 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK66_EN_1</name>
                                <description>Block66 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK67_EN</name>
                        <description>When 1, Block67 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK67_EN_0</name>
                                <description>Block67 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK67_EN_1</name>
                                <description>Block67 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK68_EN</name>
                        <description>When 1, Block68 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK68_EN_0</name>
                                <description>Block68 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK68_EN_1</name>
                                <description>Block68 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK69_EN</name>
                        <description>When 1, Block69 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK69_EN_0</name>
                                <description>Block69 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK69_EN_1</name>
                                <description>Block69 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK70_EN</name>
                        <description>When 1, Block70 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK70_EN_0</name>
                                <description>Block70 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK70_EN_1</name>
                                <description>Block70 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK71_EN</name>
                        <description>When 1, Block71 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK71_EN_0</name>
                                <description>Block71 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK71_EN_1</name>
                                <description>Block71 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK72_EN</name>
                        <description>When 1, Block72 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK72_EN_0</name>
                                <description>Block72 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK72_EN_1</name>
                                <description>Block72 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK73_EN</name>
                        <description>When 1, Block73 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK73_EN_0</name>
                                <description>Block73 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK73_EN_1</name>
                                <description>Block73 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK74_EN</name>
                        <description>When 1, Block74 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK74_EN_0</name>
                                <description>Block74 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK74_EN_1</name>
                                <description>Block74 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK75_EN</name>
                        <description>When 1, Block75 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK75_EN_0</name>
                                <description>Block75 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK75_EN_1</name>
                                <description>Block75 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK76_EN</name>
                        <description>When 1, Block76 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK76_EN_0</name>
                                <description>Block76 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK76_EN_1</name>
                                <description>Block76 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK77_EN</name>
                        <description>When 1, Block77 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK77_EN_0</name>
                                <description>Block77 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK77_EN_1</name>
                                <description>Block77 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK78_EN</name>
                        <description>When 1, Block78 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK78_EN_0</name>
                                <description>Block78 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK78_EN_1</name>
                                <description>Block78 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK79_EN</name>
                        <description>When 1, Block79 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK79_EN_0</name>
                                <description>Block79 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK79_EN_1</name>
                                <description>Block79 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK80_EN</name>
                        <description>When 1, Block80 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK80_EN_0</name>
                                <description>Block80 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK80_EN_1</name>
                                <description>Block80 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK81_EN</name>
                        <description>When 1, Block81 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK81_EN_0</name>
                                <description>Block81 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK81_EN_1</name>
                                <description>Block81 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK82_EN</name>
                        <description>When 1, Block82 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK82_EN_0</name>
                                <description>Block82 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK82_EN_1</name>
                                <description>Block82 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK83_EN</name>
                        <description>When 1, Block83 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK83_EN_0</name>
                                <description>Block83 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK83_EN_1</name>
                                <description>Block83 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK84_EN</name>
                        <description>When 1, Block84 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK84_EN_0</name>
                                <description>Block84 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK84_EN_1</name>
                                <description>Block84 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK85_EN</name>
                        <description>When 1, Block85 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK85_EN_0</name>
                                <description>Block85 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
